SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_gpcrc.h
/**************************************************************************//**
 * @file
 * @brief EFM32PG28 GPCRC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFM32PG28_GPCRC_H
#define EFM32PG28_GPCRC_H

#define GPCRC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFM32PG28_GPCRC GPCRC
 * @{
 * @brief EFM32PG28 GPCRC Register Declaration.
 *****************************************************************************/

/** GPCRC Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IP Version ID                                      */
  __IOM uint32_t             EN;                     /**< CRC Enable                                         */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IOM uint32_t             INIT;                   /**< CRC Init Value                                     */
  __IOM uint32_t             POLY;                   /**< CRC Polynomial Value                               */
  __IOM uint32_t             INPUTDATA;              /**< Input 32-bit Data Register                         */
  __IOM uint32_t             INPUTDATAHWORD;         /**< Input 16-bit Data Register                         */
  __IOM uint32_t             INPUTDATABYTE;          /**< Input 8-bit Data Register                          */
  __IM  uint32_t             DATA;                   /**< CRC Data Register                                  */
  __IM  uint32_t             DATAREV;                /**< CRC Data Reverse Register                          */
  __IM  uint32_t             DATABYTEREV;            /**< CRC Data Byte Reverse Register                     */
        uint32_t             RESERVED0[1012U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IP Version ID                                      */
  __IOM uint32_t             EN_SET;                 /**< CRC Enable                                         */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IOM uint32_t             INIT_SET;               /**< CRC Init Value                                     */
  __IOM uint32_t             POLY_SET;               /**< CRC Polynomial Value                               */
  __IOM uint32_t             INPUTDATA_SET;          /**< Input 32-bit Data Register                         */
  __IOM uint32_t             INPUTDATAHWORD_SET;     /**< Input 16-bit Data Register                         */
  __IOM uint32_t             INPUTDATABYTE_SET;      /**< Input 8-bit Data Register                          */
  __IM  uint32_t             DATA_SET;               /**< CRC Data Register                                  */
  __IM  uint32_t             DATAREV_SET;            /**< CRC Data Reverse Register                          */
  __IM  uint32_t             DATABYTEREV_SET;        /**< CRC Data Byte Reverse Register                     */
        uint32_t             RESERVED1[1012U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IP Version ID                                      */
  __IOM uint32_t             EN_CLR;                 /**< CRC Enable                                         */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IOM uint32_t             INIT_CLR;               /**< CRC Init Value                                     */
  __IOM uint32_t             POLY_CLR;               /**< CRC Polynomial Value                               */
  __IOM uint32_t             INPUTDATA_CLR;          /**< Input 32-bit Data Register                         */
  __IOM uint32_t             INPUTDATAHWORD_CLR;     /**< Input 16-bit Data Register                         */
  __IOM uint32_t             INPUTDATABYTE_CLR;      /**< Input 8-bit Data Register                          */
  __IM  uint32_t             DATA_CLR;               /**< CRC Data Register                                  */
  __IM  uint32_t             DATAREV_CLR;            /**< CRC Data Reverse Register                          */
  __IM  uint32_t             DATABYTEREV_CLR;        /**< CRC Data Byte Reverse Register                     */
        uint32_t             RESERVED2[1012U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IP Version ID                                      */
  __IOM uint32_t             EN_TGL;                 /**< CRC Enable                                         */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IOM uint32_t             INIT_TGL;               /**< CRC Init Value                                     */
  __IOM uint32_t             POLY_TGL;               /**< CRC Polynomial Value                               */
  __IOM uint32_t             INPUTDATA_TGL;          /**< Input 32-bit Data Register                         */
  __IOM uint32_t             INPUTDATAHWORD_TGL;     /**< Input 16-bit Data Register                         */
  __IOM uint32_t             INPUTDATABYTE_TGL;      /**< Input 8-bit Data Register                          */
  __IM  uint32_t             DATA_TGL;               /**< CRC Data Register                                  */
  __IM  uint32_t             DATAREV_TGL;            /**< CRC Data Reverse Register                          */
  __IM  uint32_t             DATABYTEREV_TGL;        /**< CRC Data Byte Reverse Register                     */
} GPCRC_TypeDef;
