SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_gpcrc.h
/** @} End of group EFM32PG28_GPCRC */

/**************************************************************************//**
 * @addtogroup EFM32PG28_GPCRC
 * @{
 * @defgroup EFM32PG28_GPCRC_BitFields GPCRC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for GPCRC IPVERSION */
#define _GPCRC_IPVERSION_RESETVALUE             0x00000000UL                            /**< Default value for GPCRC_IPVERSION           */
#define _GPCRC_IPVERSION_MASK                   0xFFFFFFFFUL                            /**< Mask for GPCRC_IPVERSION                    */
#define _GPCRC_IPVERSION_IPVERSION_SHIFT        0                                       /**< Shift value for GPCRC_IPVERSION             */
#define _GPCRC_IPVERSION_IPVERSION_MASK         0xFFFFFFFFUL                            /**< Bit mask for GPCRC_IPVERSION                */
#define _GPCRC_IPVERSION_IPVERSION_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for GPCRC_IPVERSION            */
#define GPCRC_IPVERSION_IPVERSION_DEFAULT       (_GPCRC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for GPCRC_IPVERSION    */

/* Bit fields for GPCRC EN */
#define _GPCRC_EN_RESETVALUE                    0x00000000UL                            /**< Default value for GPCRC_EN                  */
#define _GPCRC_EN_MASK                          0x00000001UL                            /**< Mask for GPCRC_EN                           */
#define GPCRC_EN_EN                             (0x1UL << 0)                            /**< CRC Enable                                  */
#define _GPCRC_EN_EN_SHIFT                      0                                       /**< Shift value for GPCRC_EN                    */
#define _GPCRC_EN_EN_MASK                       0x1UL                                   /**< Bit mask for GPCRC_EN                       */
#define _GPCRC_EN_EN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for GPCRC_EN                   */
#define _GPCRC_EN_EN_DISABLE                    0x00000000UL                            /**< Mode DISABLE for GPCRC_EN                   */
#define _GPCRC_EN_EN_ENABLE                     0x00000001UL                            /**< Mode ENABLE for GPCRC_EN                    */
#define GPCRC_EN_EN_DEFAULT                     (_GPCRC_EN_EN_DEFAULT << 0)             /**< Shifted mode DEFAULT for GPCRC_EN           */
#define GPCRC_EN_EN_DISABLE                     (_GPCRC_EN_EN_DISABLE << 0)             /**< Shifted mode DISABLE for GPCRC_EN           */
#define GPCRC_EN_EN_ENABLE                      (_GPCRC_EN_EN_ENABLE << 0)              /**< Shifted mode ENABLE for GPCRC_EN            */

/* Bit fields for GPCRC CTRL */
#define _GPCRC_CTRL_RESETVALUE                  0x00000000UL                            /**< Default value for GPCRC_CTRL                */
#define _GPCRC_CTRL_MASK                        0x00002710UL                            /**< Mask for GPCRC_CTRL                         */
#define GPCRC_CTRL_POLYSEL                      (0x1UL << 4)                            /**< Polynomial Select                           */
#define _GPCRC_CTRL_POLYSEL_SHIFT               4                                       /**< Shift value for GPCRC_POLYSEL               */
#define _GPCRC_CTRL_POLYSEL_MASK                0x10UL                                  /**< Bit mask for GPCRC_POLYSEL                  */
#define _GPCRC_CTRL_POLYSEL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_POLYSEL_CRC32               0x00000000UL                            /**< Mode CRC32 for GPCRC_CTRL                   */
#define _GPCRC_CTRL_POLYSEL_CRC16               0x00000001UL                            /**< Mode CRC16 for GPCRC_CTRL                   */
#define GPCRC_CTRL_POLYSEL_DEFAULT              (_GPCRC_CTRL_POLYSEL_DEFAULT << 4)      /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_POLYSEL_CRC32                (_GPCRC_CTRL_POLYSEL_CRC32 << 4)        /**< Shifted mode CRC32 for GPCRC_CTRL           */
#define GPCRC_CTRL_POLYSEL_CRC16                (_GPCRC_CTRL_POLYSEL_CRC16 << 4)        /**< Shifted mode CRC16 for GPCRC_CTRL           */
#define GPCRC_CTRL_BYTEMODE                     (0x1UL << 8)                            /**< Byte Mode Enable                            */
#define _GPCRC_CTRL_BYTEMODE_SHIFT              8                                       /**< Shift value for GPCRC_BYTEMODE              */
#define _GPCRC_CTRL_BYTEMODE_MASK               0x100UL                                 /**< Bit mask for GPCRC_BYTEMODE                 */
#define _GPCRC_CTRL_BYTEMODE_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define GPCRC_CTRL_BYTEMODE_DEFAULT             (_GPCRC_CTRL_BYTEMODE_DEFAULT << 8)     /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BITREVERSE                   (0x1UL << 9)                            /**< Byte-level Bit Reverse Enable               */
#define _GPCRC_CTRL_BITREVERSE_SHIFT            9                                       /**< Shift value for GPCRC_BITREVERSE            */
#define _GPCRC_CTRL_BITREVERSE_MASK             0x200UL                                 /**< Bit mask for GPCRC_BITREVERSE               */
#define _GPCRC_CTRL_BITREVERSE_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_BITREVERSE_NORMAL           0x00000000UL                            /**< Mode NORMAL for GPCRC_CTRL                  */
#define _GPCRC_CTRL_BITREVERSE_REVERSED         0x00000001UL                            /**< Mode REVERSED for GPCRC_CTRL                */
#define GPCRC_CTRL_BITREVERSE_DEFAULT           (_GPCRC_CTRL_BITREVERSE_DEFAULT << 9)   /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BITREVERSE_NORMAL            (_GPCRC_CTRL_BITREVERSE_NORMAL << 9)    /**< Shifted mode NORMAL for GPCRC_CTRL          */
#define GPCRC_CTRL_BITREVERSE_REVERSED          (_GPCRC_CTRL_BITREVERSE_REVERSED << 9)  /**< Shifted mode REVERSED for GPCRC_CTRL        */
#define GPCRC_CTRL_BYTEREVERSE                  (0x1UL << 10)                           /**< Byte Reverse Mode                           */
#define _GPCRC_CTRL_BYTEREVERSE_SHIFT           10                                      /**< Shift value for GPCRC_BYTEREVERSE           */
#define _GPCRC_CTRL_BYTEREVERSE_MASK            0x400UL                                 /**< Bit mask for GPCRC_BYTEREVERSE              */
#define _GPCRC_CTRL_BYTEREVERSE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define _GPCRC_CTRL_BYTEREVERSE_NORMAL          0x00000000UL                            /**< Mode NORMAL for GPCRC_CTRL                  */
#define _GPCRC_CTRL_BYTEREVERSE_REVERSED        0x00000001UL                            /**< Mode REVERSED for GPCRC_CTRL                */
#define GPCRC_CTRL_BYTEREVERSE_DEFAULT          (_GPCRC_CTRL_BYTEREVERSE_DEFAULT << 10) /**< Shifted mode DEFAULT for GPCRC_CTRL         */
#define GPCRC_CTRL_BYTEREVERSE_NORMAL           (_GPCRC_CTRL_BYTEREVERSE_NORMAL << 10)  /**< Shifted mode NORMAL for GPCRC_CTRL          */
#define GPCRC_CTRL_BYTEREVERSE_REVERSED         (_GPCRC_CTRL_BYTEREVERSE_REVERSED << 10) /**< Shifted mode REVERSED for GPCRC_CTRL        */
#define GPCRC_CTRL_AUTOINIT                     (0x1UL << 13)                           /**< Auto Init Enable                            */
#define _GPCRC_CTRL_AUTOINIT_SHIFT              13                                      /**< Shift value for GPCRC_AUTOINIT              */
#define _GPCRC_CTRL_AUTOINIT_MASK               0x2000UL                                /**< Bit mask for GPCRC_AUTOINIT                 */
#define _GPCRC_CTRL_AUTOINIT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPCRC_CTRL                 */
#define GPCRC_CTRL_AUTOINIT_DEFAULT             (_GPCRC_CTRL_AUTOINIT_DEFAULT << 13)    /**< Shifted mode DEFAULT for GPCRC_CTRL         */

