SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_gpcrc.h
/* Bit fields for GPCRC CMD */
#define _GPCRC_CMD_RESETVALUE                   0x00000000UL                            /**< Default value for GPCRC_CMD                 */
#define _GPCRC_CMD_MASK                         0x80000001UL                            /**< Mask for GPCRC_CMD                          */
#define GPCRC_CMD_INIT                          (0x1UL << 0)                            /**< Initialization Enable                       */
#define _GPCRC_CMD_INIT_SHIFT                   0                                       /**< Shift value for GPCRC_INIT                  */
#define _GPCRC_CMD_INIT_MASK                    0x1UL                                   /**< Bit mask for GPCRC_INIT                     */
#define _GPCRC_CMD_INIT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for GPCRC_CMD                  */
#define GPCRC_CMD_INIT_DEFAULT                  (_GPCRC_CMD_INIT_DEFAULT << 0)          /**< Shifted mode DEFAULT for GPCRC_CMD          */

/* Bit fields for GPCRC INIT */
#define _GPCRC_INIT_RESETVALUE                  0x00000000UL                            /**< Default value for GPCRC_INIT                */
#define _GPCRC_INIT_MASK                        0xFFFFFFFFUL                            /**< Mask for GPCRC_INIT                         */
#define _GPCRC_INIT_INIT_SHIFT                  0                                       /**< Shift value for GPCRC_INIT                  */
#define _GPCRC_INIT_INIT_MASK                   0xFFFFFFFFUL                            /**< Bit mask for GPCRC_INIT                     */
#define _GPCRC_INIT_INIT_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPCRC_INIT                 */
#define GPCRC_INIT_INIT_DEFAULT                 (_GPCRC_INIT_INIT_DEFAULT << 0)         /**< Shifted mode DEFAULT for GPCRC_INIT         */

/* Bit fields for GPCRC POLY */
#define _GPCRC_POLY_RESETVALUE                  0x00000000UL                            /**< Default value for GPCRC_POLY                */
#define _GPCRC_POLY_MASK                        0x0000FFFFUL                            /**< Mask for GPCRC_POLY                         */
#define _GPCRC_POLY_POLY_SHIFT                  0                                       /**< Shift value for GPCRC_POLY                  */
#define _GPCRC_POLY_POLY_MASK                   0xFFFFUL                                /**< Bit mask for GPCRC_POLY                     */
#define _GPCRC_POLY_POLY_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPCRC_POLY                 */
#define GPCRC_POLY_POLY_DEFAULT                 (_GPCRC_POLY_POLY_DEFAULT << 0)         /**< Shifted mode DEFAULT for GPCRC_POLY         */

/* Bit fields for GPCRC INPUTDATA */
#define _GPCRC_INPUTDATA_RESETVALUE             0x00000000UL                            /**< Default value for GPCRC_INPUTDATA           */
#define _GPCRC_INPUTDATA_MASK                   0xFFFFFFFFUL                            /**< Mask for GPCRC_INPUTDATA                    */
#define _GPCRC_INPUTDATA_INPUTDATA_SHIFT        0                                       /**< Shift value for GPCRC_INPUTDATA             */
#define _GPCRC_INPUTDATA_INPUTDATA_MASK         0xFFFFFFFFUL                            /**< Bit mask for GPCRC_INPUTDATA                */
#define _GPCRC_INPUTDATA_INPUTDATA_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for GPCRC_INPUTDATA            */
#define GPCRC_INPUTDATA_INPUTDATA_DEFAULT       (_GPCRC_INPUTDATA_INPUTDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for GPCRC_INPUTDATA    */

/* Bit fields for GPCRC INPUTDATAHWORD */
#define _GPCRC_INPUTDATAHWORD_RESETVALUE        0x00000000UL                            /**< Default value for GPCRC_INPUTDATAHWORD      */
#define _GPCRC_INPUTDATAHWORD_MASK              0x0000FFFFUL                            /**< Mask for GPCRC_INPUTDATAHWORD               */
#define _GPCRC_INPUTDATAHWORD_INPUTDATAHWORD_SHIFT 0                                       /**< Shift value for GPCRC_INPUTDATAHWORD        */
#define _GPCRC_INPUTDATAHWORD_INPUTDATAHWORD_MASK 0xFFFFUL                                /**< Bit mask for GPCRC_INPUTDATAHWORD           */
#define _GPCRC_INPUTDATAHWORD_INPUTDATAHWORD_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for GPCRC_INPUTDATAHWORD       */
#define GPCRC_INPUTDATAHWORD_INPUTDATAHWORD_DEFAULT (_GPCRC_INPUTDATAHWORD_INPUTDATAHWORD_DEFAULT << 0) /**< Shifted mode DEFAULT for GPCRC_INPUTDATAHWORD*/

/* Bit fields for GPCRC INPUTDATABYTE */
#define _GPCRC_INPUTDATABYTE_RESETVALUE         0x00000000UL                            /**< Default value for GPCRC_INPUTDATABYTE       */
#define _GPCRC_INPUTDATABYTE_MASK               0x000000FFUL                            /**< Mask for GPCRC_INPUTDATABYTE                */
#define _GPCRC_INPUTDATABYTE_INPUTDATABYTE_SHIFT 0                                       /**< Shift value for GPCRC_INPUTDATABYTE         */
#define _GPCRC_INPUTDATABYTE_INPUTDATABYTE_MASK 0xFFUL                                  /**< Bit mask for GPCRC_INPUTDATABYTE            */
#define _GPCRC_INPUTDATABYTE_INPUTDATABYTE_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for GPCRC_INPUTDATABYTE        */
#define GPCRC_INPUTDATABYTE_INPUTDATABYTE_DEFAULT (_GPCRC_INPUTDATABYTE_INPUTDATABYTE_DEFAULT << 0) /**< Shifted mode DEFAULT for GPCRC_INPUTDATABYTE*/

/* Bit fields for GPCRC DATA */
#define _GPCRC_DATA_RESETVALUE                  0x00000000UL                            /**< Default value for GPCRC_DATA                */
#define _GPCRC_DATA_MASK                        0xFFFFFFFFUL                            /**< Mask for GPCRC_DATA                         */
#define _GPCRC_DATA_DATA_SHIFT                  0                                       /**< Shift value for GPCRC_DATA                  */
#define _GPCRC_DATA_DATA_MASK                   0xFFFFFFFFUL                            /**< Bit mask for GPCRC_DATA                     */
#define _GPCRC_DATA_DATA_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for GPCRC_DATA                 */
#define GPCRC_DATA_DATA_DEFAULT                 (_GPCRC_DATA_DATA_DEFAULT << 0)         /**< Shifted mode DEFAULT for GPCRC_DATA         */

/* Bit fields for GPCRC DATAREV */
#define _GPCRC_DATAREV_RESETVALUE               0x00000000UL                            /**< Default value for GPCRC_DATAREV             */
#define _GPCRC_DATAREV_MASK                     0xFFFFFFFFUL                            /**< Mask for GPCRC_DATAREV                      */
#define _GPCRC_DATAREV_DATAREV_SHIFT            0                                       /**< Shift value for GPCRC_DATAREV               */
#define _GPCRC_DATAREV_DATAREV_MASK             0xFFFFFFFFUL                            /**< Bit mask for GPCRC_DATAREV                  */
#define _GPCRC_DATAREV_DATAREV_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for GPCRC_DATAREV              */
#define GPCRC_DATAREV_DATAREV_DEFAULT           (_GPCRC_DATAREV_DATAREV_DEFAULT << 0)   /**< Shifted mode DEFAULT for GPCRC_DATAREV      */

/* Bit fields for GPCRC DATABYTEREV */
#define _GPCRC_DATABYTEREV_RESETVALUE           0x00000000UL                            /**< Default value for GPCRC_DATABYTEREV         */
#define _GPCRC_DATABYTEREV_MASK                 0xFFFFFFFFUL                            /**< Mask for GPCRC_DATABYTEREV                  */
#define _GPCRC_DATABYTEREV_DATABYTEREV_SHIFT    0                                       /**< Shift value for GPCRC_DATABYTEREV           */
#define _GPCRC_DATABYTEREV_DATABYTEREV_MASK     0xFFFFFFFFUL                            /**< Bit mask for GPCRC_DATABYTEREV              */
#define _GPCRC_DATABYTEREV_DATABYTEREV_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPCRC_DATABYTEREV          */
#define GPCRC_DATABYTEREV_DATABYTEREV_DEFAULT   (_GPCRC_DATABYTEREV_DATABYTEREV_DEFAULT << 0) /**< Shifted mode DEFAULT for GPCRC_DATABYTEREV  */

/** @} End of group EFM32PG28_GPCRC_BitFields */
/** @} End of group EFM32PG28_GPCRC */
/** @} End of group Parts */

#endif // EFM32PG28_GPCRC_H
